1c/configuration/InformationRegisters/ЛК_НастройкиСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛК_НастройкиСервисов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогинПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньЛогирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/configuration/InformationRegisters/ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛК_ОчередьОбменаСЛКПроизвольнымиДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛК_СтатусОбменаСЛК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипОбъкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛК_ВидыСобытийСОбъектамиЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХЭШ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/configuration/InformationRegisters/ЛК_НастройкиСервисов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Уровень Из ЛК_ОбменДаннымиПовтИсп.УровниЛога()  Цикл
		Элементы.УровеньЛогирования.СписокВыбора.Добавить(Уровень.Ключ);	
	КонецЦикла;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)

	Если ПроверитьПодключениеНаСервере() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Связь установлена!");
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Связь не установлена!");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Инициализировать(Команда) 
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала необходимо записать элемент!");
	Иначе	  
		
	   	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начата регистрация элементов для обмена.");
		ЗарегистрироватьЭлементыДляОбмена();  
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начат обмен."); 
		ВыполнитьОбменаНаСервере();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обмен закончен."); 
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбменаНаСервере()
	
	ЛК_ОбменДаннымиСервер.ВыполнитьОбмен(Истина);
	
КонецПроцедуры	

&НаСервере
Процедура ЗарегистрироватьЭлементыДляОбмена()

	НовыйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.СоздатьЭлемент();
	НовыйЭлемент.Наименование = "Новый";
	НовыйЭлемент.Код = 2;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.СоздатьЭлемент();
	НовыйЭлемент.Наименование = "В работе";
	НовыйЭлемент.Код = 3;
	НовыйЭлемент.Записать();

	НовыйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.СоздатьЭлемент();
	НовыйЭлемент.Наименование = "Отменена";
	НовыйЭлемент.Код = 4;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.СоздатьЭлемент();
	НовыйЭлемент.Наименование = "Выполнена";
	НовыйЭлемент.Код = 5;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.ЛК_ТипыСправок.СоздатьЭлемент();
	НовыйЭлемент.Наименование = "НДФЛ";
	НовыйЭлемент.Код = 1;
	НовыйЭлемент.Записать();
	
	Выборка = Справочники.ВидыИспользованияРабочегоВремени.Выбрать();
	Пока Выборка.Следующий() Цикл 
		ЛК_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
	КонецЦикла;	
	
	Выборка = Справочники.ГрафикиРаботыСотрудников.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ЛК_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст =" 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГрафикиРаботыПоВидамВремени.Месяц КАК Месяц,
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы КАК ГрафикРаботы
		|ИЗ
		|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяц
		|";
		Запрос.Параметры.Вставить("ГрафикРаботы", Выборка.Ссылка); 
		
		ВыборкаЗапроса =  Запрос.Выполнить().Выбрать();
		
		ТипОбъекта	= ЛК_ОбменДаннымиПовтИсп.ТипыОбъектов().РСНЗ;
		ИмяОбъекта = "ГрафикиРаботыПоВидамВремени";

		
		Пока ВыборкаЗапроса.Следующий() Цикл 
			
			Структура = Новый Структура;
			Структура.Вставить("ГрафикРаботы",     Выборка.Ссылка);
			Структура.Вставить("Месяц",            ВыборкаЗапроса.Месяц);
			
			ДанныеJSON = ЛК_РаботаСJSONСервер.ЗаписьJSON(Структура);	
			
			ХешированиеДанных  = Новый ХешированиеДанных (ХешФункция.CRC32);
			ХешированиеДанных.Добавить(ДанныеJSON);
			ХешСумма = ХешированиеДанных.ХешСумма;
			
			РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьДобавлениеОбъекта(ТипОбъекта, ИмяОбъекта, ХешСумма, ДанныеJSON);
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Организации.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Организации КАК Организации";
				
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛК_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодразделенияОрганизаций.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций";
	

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛК_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Должности.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Должности КАК Должности";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛК_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
	КонецЦикла;       
	
	ЛК_ОбменДаннымиСервер.ВыполнитьОбмен();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПодключениеНаСервере()   
	
	НастройкиСервисаСтруктура = ЛК_РаботаСФункциямиКлиентСервер.СтруктураВозврата(); 
	
	СтруктураРезультата = Новый Структура("АдресСервера, ЛогинПользователя, ПарольПользователя, ИДБазы");
	СтруктураРезультата.АдресСервера       = Запись.АдресСервера; 
	СтруктураРезультата.ЛогинПользователя  = Запись.ЛогинПользователя;
	СтруктураРезультата.ПарольПользователя = Запись.ПарольПользователя;
	СтруктураРезультата.ИДБазы 			   = Запись.ИДБазы;
	
    ЛК_РаботаСФункциямиКлиентСервер.ДобавитьРезультат(НастройкиСервисаСтруктура, СтруктураРезультата);

	Если ЛК_РаботаСФункциямиКлиентСервер.Ошибка(НастройкиСервисаСтруктура) Тогда

		ЛК_РаботаСФункциямиКлиентСервер.СообщитьОбОшибках(НастройкиСервисаСтруктура);		
		Возврат Ложь;  
		
	КонецЕсли;
	
	НастройкиСервиса = ЛК_РаботаСФункциямиКлиентСервер.Результат(НастройкиСервисаСтруктура);
	
	ТокенСтруктура = ЛК_ОбменДаннымиСервер.Логин(НастройкиСервиса); 
	Если ЛК_РаботаСФункциямиКлиентСервер.Ошибка(ТокенСтруктура) Тогда
		
		ЛК_РаботаСФункциямиКлиентСервер.СообщитьОбОшибках(ТокенСтруктура);	
		Возврат Ложь; 
		
	КонецЕсли; 
	
	Возврат Истина;

КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	НайденныйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.НайтиПоКоду(2);
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		Элементы.Инициализировать.Доступность = Ложь;
	Иначе 
		Элементы.Инициализировать.Доступность = Истина;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти
